using System;

namespace cvTextToBB {
  class Program {
    static byte convertChar(char c) {
      byte retC = (byte)' ';
      c = char.ToUpper(c);
      switch (c) {
        case '\n': retC = 0x0D; break;
        case ' ':
        case '!':
        case '"':
        case '#':
        case '$':
        case '%':
        case '&':
        case '\'':
        case '(':
        case ')':
        case '*':
        case '+':
        case ',':
        case '-':
        case '.':
        case '/':
        case '0':
        case '1':
        case '2':
        case '3':
        case '4':
        case '5':
        case '6':
        case '7':
        case '8':
        case '9':
        case ':':
        case ';':
        case '<':
        case '=':
        case '>':
        case '?':
        case '@':
        case 'A':
        case 'B':
        case 'C':
        case 'D':
        case 'E':
        case 'F':
        case 'G':
        case 'H':
        case 'I':
        case 'J':
        case 'K':
        case 'L':
        case 'M':
        case 'N':
        case 'O':
        case 'P':
        case 'Q':
        case 'R':
        case 'S':
        case 'T':
        case 'U':
        case 'V':
        case 'W':
        case 'X':
        case 'Y':
        case 'Z':
        case '[':
        case '\\':
        case ']':
        case '^':
        case '_': retC = (byte)c; break;
        case 'А': retC = 0x40 + 0x20; break;
        case 'Б': retC = 0x41 + 0x20; break;
        case 'В': retC = 0x42 + 0x20; break;
        case 'Г': retC = 0x43 + 0x20; break;
        case 'Д': retC = 0x44 + 0x20; break;
        case 'Е': retC = 0x45 + 0x20; break;
        case 'Ж': retC = 0x46 + 0x20; break;
        case 'З': retC = 0x47 + 0x20; break;
        case 'И': retC = 0x48 + 0x20; break;
        case 'Й': retC = 0x49 + 0x20; break;
        case 'К': retC = 0x4A + 0x20; break;
        case 'Л': retC = 0x4B + 0x20; break;
        case 'М': retC = 0x4C + 0x20; break;
        case 'Н': retC = 0x4D + 0x20; break;
        case 'О': retC = 0x4E + 0x20; break;
        case 'П': retC = 0x4F + 0x20; break;
        case 'Р': retC = 0x50 + 0x20; break;
        case 'С': retC = 0x51 + 0x20; break;
        case 'Т': retC = 0x52 + 0x20; break;
        case 'У': retC = 0x53 + 0x20; break;
        case 'Ф': retC = 0x54 + 0x20; break;
        case 'Х': retC = 0x55 + 0x20; break;
        case 'Ц': retC = 0x56 + 0x20; break;
        case 'Ч': retC = 0x57 + 0x20; break;
        case 'Ш': retC = 0x58 + 0x20; break;
        case 'Щ': retC = 0x59 + 0x20; break;
        case 'Ъ': retC = 0x5A + 0x20; break;
        case 'Ы': retC = 0x5B + 0x20; break;
        case 'Ь': retC = 0x5C + 0x20; break;
        case 'Э': retC = 0x5D + 0x20; break;
        case 'Ю': retC = 0x5E + 0x20; break;
        case 'Я': retC = 0x5F + 0x20; break;
        default: retC = (byte)' '; break;
      }
      return retC;
    }
    static void Main(string[] args) {
      string[] textArr = new string[] {
        "Плотожор       ",
        "Крыс-воин      ",
        "Ползун         ",
        "Гном           ",
        "Гоблин         ",
        "Гремлин        ",
        "Страж          ",
        "Кобольд        ",
        "Личинка-мутант ",
        "Орк            ",
        "Полтергейст    ",
        "Бешеный шакал  ",
        "Скелет         ",
        "Змей           ",
        "Дух            ",
        "Нетопырь       ",
        "слабый демон   ",
        "Пес-демон      ",
        "жук-Навозник   ",
        "красный муравей",
        "Вурдалак       ",
        "Гнолл          ",
        "карга          ",
        "чумная саранча ",
        "Орк-воевода    ",
        "Прокаженный    ",
        "гнилой труп    ",
        "Землеройка     ",
        "Сорняк         ",
        "Вор            ",
        "Троглодит      ",
        "Зомби          ",
        "Капля кислоты  ",
        "Кентавр        ",
        "Клерик         ",
        "Малый дьявол   ",
        "огненный жук   ",
        "горгулья       ",
        "большой муравей",
        "Диноящер       ",
        "Паук-гигант    ",
        "Гарпия         ",
        "Гиппогриф      ",
        "Пчелы-убийцы   ",
        "Пегас          ",
        "Теневой зверь  ",
        "Кабан          ",
        "Волколак       ",
        "Варвар         ",
        "Кариатида-страж",
        "Кокатрикс      ",
        "Циклоп         ",
        "Друид          ",
        "жук-носорог    ",
        "костянка-гигант",
        "Волшебник      ",
        "Ополченец      ",
        "Орк-вождь      ",
        "Огр            ",
        "Сатир          ",
        "осиный рой     ",
        "Единорог       ",
        "Оборотень      ",
        "Вайт           ",
        "Варвар-вождь   ",
        "Василиск       ",
        "небесный олень ",
        "пылевой демон  ",
        "скорпион-гигант",
        "5-главая гидра ",
        "Кот-воитель    ",
        "Минотавр       ",
        "Огр-вождь      ",
        "туманный пантро",
        "Фантом         ",
        "Мечник         ",
        "Тролль         ",
        "голем из дерева",
        "Тень           ",
        "Йети           ",
        "Опасные споры  ",
        "Заклинательница",
        "огненный ящер  ",
        "ленивец-гигант ",
        "Грифон         ",
        "Огненная гидра ",
        "кобыла-людоед  ",
        "Мантикора      ",
        "Медуза         ",
        "Ракшаса        ",
        "Голем из камня ",
        "Пещерный тролль",
        "Горный тролль  ",
        "Чернокнижник   ",
        "Беорн          ",
        "Злая ведьма    ",
        "Ассасин        ",
        "Баньши         ",
        "Пещерный гигант",
        "Химера         ",
        "Элементал-ветер",
        "Палач          ",
        "Горгон         ",
        "малый демон    ",
        "малый дьявол   ",
        "Мумия          ",
        "Некромант      ",
        "Призрак        ",
        "Белый волк     ",
        "Виверн         ",
        "Зеленый дракон ",
        "Синий дракон   ",
        "Злой глаз      ",
        "Элементал земли",
        "Привидение     ",
        "Снежный гигант ",
        "каменный гигант",
        "8-главая гидра ",
        "Лавовый зверь  ",
        "богомол-воитель",
        "Нага           ",
        "Диножук        ",
        "Сфинкс         ",
        "Вампир         ",
        "Воин           ",
        "колдун         ",
        "Белый дракон   ",
        "Серый дракон   ",
        "Архидруид      ",
        "Рыцарь хаоса   ",
        "большой демон  ",
        "большой дьявол ",
        "Элементал огня ",
        "дух-страж      ",
        "Гигант бури    ",
        "12-главая гидра",
        "Невидимка      ",
        "Маг            ",
        "Мастер-вор     ",
        "Голем из стали ",
        "Фазовая мумия  ",
        "Черный дракон  ",
        "Красный дракон ",
        "XX!XX!XX!XX!XX ",
        "Черный рыцарь  ",
        "Демон-лорд     ",
        "Архидьявол     ",
        "Золотой дракон ",
        "Седой дракон   ",
        "Голем из алмаза",
        "16-главая гидра",
        "Высший клерик  ",
        "Кирин          ",
        "Лич            ",
        "Архимаг        ",
        "Мастер-лучник  ",
        "Феникс         ",
        "Рух            ",
        "Песчаный червь ",
        "Титан          ",
        "Водяной        ",
        "Бобровая крыса ",
        "Минога         ",
        "огромная пиявка",
        "Крокодил       ",
        "краб-гигант    ",
        "Барракуда      ",
        "Спрут-гигант   ",
        "Электр. угорь  ",
        "Морская карга  ",
        "Гиппокамп      ",
        "Акула          ",
        "Сирена         ",
        "Элементал воды ",
        "Морской змей   ",
        "Морской дракон ",
        "Скорпион       ",
        "Черный всадник ",
        "Крылатый зверь ",
        "морской зверь  ",
        "Демон-король   ",
        "Королева-суккуб",
        "Тиранозавр     ",
        "Чужой          ",
        "Абориген       ",
        "Бог-вулкан     ",
        "Пол Пэд        ",
        "Пират          ",
        "Пират-капитан  ",
        "Серый Минотавр ",
        "Лорд Лучник    ",
        "Бронтозавр     ",
        "Стегозавр      ",
        "Труп-убийца    ",
        "Окрим          "
      };

      int addr = 0x01B312;
      foreach (string s in textArr) {
        byte[] bb = new byte[s.Length + 1];
        for (int i = 0; i < s.Length; i++)
          bb[i] = convertChar(s[i]);
        bb[s.Length] = 0x00;
        Console.WriteLine(addr.ToString("X6") + "   " + BitConverter.ToString(bb).Replace("-", " "));
        addr += 0x20;
        //for (int i = 0; i <= s.Length; i++)
        //  Console.Write("{0}");
        //int j = 0;
      }
    }
  }
}
